In [1]:
import numpy as np 
import pandas as pd

In [2]:
import os 
os.chdir('/Users/kimmh/Desktop/서데캠/')
os.getcwd()

'/Users/kimmh/Desktop/서데캠'

In [3]:
dt = pd.read_table('./data/TB_T_RSPOP_ADMI.txt',sep='|')
dt.columns = ['STD_YM', 'ADMI_CD', 'ADMI_NM', 'SEXDSTN_CD', 'AGRDE_CD', 'RSPOP_CNT', 'CTY_NM']
dt.head()

     STD_YM     ADMI_CD ADMI_NM SEXDSTN_CD AGRDE_CD RSPOP_CNT  CTY_NM
0  `201807`  `11230660`  `장안2동`        `1`   `0004`     `667`  `동대문구`
1  `201807`  `11590660`   `대방동`        `1`   `0004`     `599`   `동작구`
2  `201807`  `11170700`   `보광동`        `1`   `0004`     `156`   `용산구`
3  `201807`  `11290525`   `성북동`        `1`   `0004`     `210`   `성북구`
4  `201807`  `11620585`  `낙성대동`        `1`   `0004`     `228`   `관악구`

* STD_YM: 기준년월
* ADMI_CD: 행정동코드 8자리
* ADMI_NM: 행정동명
* SEXDSTN_CD: 성별 코드 (1=남, 2=여) 
* AGRDE_CD: 연령대 코드 
* RSPOP_CNT: 거주인구 수
* CTY_NM: 시군구명

In [4]:
pd.Series(dt['STD_YM'].unique()).sort_values()

14     `201112`
15     `201201`
1      `201202`
16     `201203`
17     `201204`
         ...
110    `202102`
111    `202104`
112    `202105`
113    `202106`
114    `202107`
Length: 115, dtype: object

**2011년 12월부터 2021년 7월까지 총 (1+12*9+7) = 116 이어야 하는데 왜 115일까?  
2021년 3월 데이터가 없음 시발..**

In [5]:
why_115 = dt[dt['STD_YM']==202103]
why_115

Empty DataFrame
Columns: [STD_YM, ADMI_CD, ADMI_NM, SEXDSTN_CD, AGRDE_CD, RSPOP_CNT, CTY_NM]
Index: []

In [6]:
dt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2046404 entries, 0 to 2046403
Data columns (total 7 columns):
 #   Column      Dtype
---  ------      -----
 0   STD_YM      object
 1   ADMI_CD     object
 2   ADMI_NM     object
 3   SEXDSTN_CD  object
 4   AGRDE_CD    object
 5   RSPOP_CNT   object
 6   CTY_NM      object
dtypes: object(7)
memory usage: 109.3+ MB

In [7]:
dt['SEXDSTN_CD'].value_counts()  # 성별 1=남 2=여

`1`    1023202
`2`    1023202
Name: SEXDSTN_CD, dtype: int64

In [8]:
dt['AGRDE_CD'].value_counts()  # 연령을 5살 기준으로 나눈 코드 (총 22가지)

`9599`    97448
`1014`    97448
`6064`    97448
`2529`    97448
`3034`    97448
`6569`    97448
`3539`    97448
`2024`    97448
`7074`    97448
`0509`    97448
`8084`    97448
`1519`    97448
`4549`    97448
`9094`    97448
`5559`    97448
`5054`    97448
`4044`    97448
`8589`    97448
`7579`    97448
`0004`    97444
`9999`    50810
`I00`     46638
Name: AGRDE_CD, dtype: int64

#### 성별 / 연령이 필요할까?  일단 제거  
42가지 경우의 수 제거됨

In [9]:
dt = dt.drop(['SEXDSTN_CD', 'AGRDE_CD'], axis=1)
dt.head()

     STD_YM     ADMI_CD ADMI_NM RSPOP_CNT  CTY_NM
0  `201807`  `11230660`  `장안2동`     `667`  `동대문구`
1  `201807`  `11590660`   `대방동`     `599`   `동작구`
2  `201807`  `11170700`   `보광동`     `156`   `용산구`
3  `201807`  `11290525`   `성북동`     `210`   `성북구`
4  `201807`  `11620585`  `낙성대동`     `228`   `관악구`

#### 양 옆의 따옴표 다 제거

In [10]:
# dt = dt.apply(lambda x: x.str.strip('`'), axis = 1)   >>> 너무 오래 걸려서 혹시나 코드 돌려볼 때 방해될까봐 주석처리

In [21]:
# dt['RSPOP_CNT'] = pd.to_numeric(dt['RSPOP_CNT'])
# dt.info()

#### 따옴표 제거하여 저장

In [12]:
# dt.to_csv('TB_T_RSPOP_ADMI_processed.txt', sep=',', index=False)  >>> 전처리한 데이터 따로 저장

---

### 전처리한 데이터로 다시 open

In [26]:
dt = pd.read_table('./data/TB_T_RSPOP_ADMI_processed.txt',sep=',')
dt.head()

   STD_YM   ADMI_CD ADMI_NM  RSPOP_CNT CTY_NM
0  201807  11230660    장안2동        667   동대문구
1  201807  11590660     대방동        599    동작구
2  201807  11170700     보광동        156    용산구
3  201807  11290525     성북동        210    성북구
4  201807  11620585    낙성대동        228    관악구

In [27]:
dt.shape

(2046404, 5)

### 일단 2021년 7월 따로 저장해두기

In [34]:
dt_2107 = dt[dt['STD_YM']==202107]
dt_2107['STD_YM'].unique()

array([202107])

In [36]:
dt_new = dt_2107.reset_index(drop=True)
print(dt_new.shape)
dt_new.head()

(17766, 5)

   STD_YM   ADMI_CD ADMI_NM  RSPOP_CNT CTY_NM
0  202107  11200540     마장동        265    성동구
1  202107  11290555     삼선동        205    성북구
2  202107  11545510     가산동        177    금천구
3  202107  11560605     문래동        769   영등포구
4  202107  11470560    신월1동        215    양천구

In [37]:
# dt_new.to_csv('TB_T_RSPOP_ADMI_2107.txt', sep = ',', index = False)

---

In [32]:
data = dt.groupby(['STD_YM', 'ADMI_CD', 'ADMI_NM', 'CTY_NM'])
grouped = data.sum('RSPOP_CNT')
grouped = grouped.reset_index()
print(grouped.shape)
grouped.head()

(48724, 5)

   STD_YM   ADMI_CD ADMI_NM CTY_NM  RSPOP_CNT
0  201112  11110515   청운효자동    종로구      15260
1  201112  11110530     사직동    종로구      10150
2  201112  11110540     삼청동    종로구       3415
3  201112  11110550     부암동    종로구      11369
4  201112  11110560     평창동    종로구      19677

In [31]:
dt.shape[0] / grouped.shape[0]

41.999917904933916

약 42 = 성별 2가지 * 연령 22가지 (연령 구분 2가지가 없는 경우도 있어서)

In [16]:
grouped['ADMI_NM'].value_counts()

신사동      230
쌍문3동     115
창1동      115
목3동      115
노량진1동    115
        ...
신당4동      19
신당6동      19
신당3동      19
신당1동      19
명륜3가동      8
Name: ADMI_NM, Length: 429, dtype: int64

명륜3가동 등 너무 적어서 뭐지 싶었는데  
원본 데이터의 명륜3가동 row 수가 336으로 8 * 42 로 맞아 떨어지는 것으로 보아  
새로 생긴 행정동 이름인 듯

In [18]:
grouped['ADMI_NM'].value_counts().head()

신사동      230
쌍문3동     115
창1동      115
목3동      115
노량진1동    115
Name: ADMI_NM, dtype: int64

In [19]:
grouped['ADMI_NM'].unique()

array(['청운효자동', '사직동', '삼청동', '부암동', '평창동', '무악동', '교남동', '가회동',
       '종로1.2.3.4가동', '종로5.6가동', '이화동', '혜화동', '명륜3가동', '창신1동', '창신2동',
       '창신3동', '숭인1동', '숭인2동', '소공동', '회현동', '명동', '필동', '장충동', '광희동',
       '을지로동', '신당1동', '신당2동', '신당3동', '신당4동', '신당5동', '신당6동', '황학동',
       '중림동', '후암동', '용산2가동', '남영동', '청파동', '원효로1동', '원효로2동', '효창동',
       '용문동', '한강로동', '이촌1동', '이촌2동', '이태원1동', '이태원2동', '한남동', '서빙고동',
       '보광동', '왕십리2동', '왕십리도선동', '마장동', '사근동', '행당1동', '행당2동', '응봉동',
       '금호1가동', '금호2.3가동', '금호4가동', '옥수동', '성수1가1동', '성수1가2동', '성수2가1동',
       '성수2가3동', '송정동', '용답동', '화양동', '군자동', '중곡1동', '중곡2동', '중곡3동',
       '중곡4동', '능동', '광장동', '자양1동', '자양2동', '자양3동', '자양4동', '구의1동',
       '구의2동', '구의3동', '용신동', '제기동', '전농1동', '전농2동', '답십리1동', '답십리2동',
       '장안1동', '장안2동', '청량리동', '회기동', '휘경1동', '휘경2동', '이문1동', '이문2동',
       '면목2동', '면목4동', '면목5동', '면목본동', '면목7동', '면목3.8동', '상봉1동', '상봉2동',
       '중화1동', '중화2동', '묵1동', '묵2동', '망우본동', '망우3동', '신내1동', '신내2동',
       '성북동', '삼선동', '동선동', '돈암1동', '돈암2동', '안암동', '보문동', '정릉1동', '정릉2동',
       '정릉3동', '정릉4동', '길음1동', '길음2동', '종암동', '월곡1동', '월곡2동', '장위1동',
       '장위2동', '장위3동', '석관동', '삼양동', '미아동', '송중동', '송천동', '삼각산동', '번1동',
       '번2동', '번3동', '수유1동', '수유2동', '수유3동', '우이동', '인수동', '창1동', '창2동',
       '창3동', '창4동', '창5동', '도봉1동', '도봉2동', '쌍문1동', '쌍문2동', '쌍문3동',
       '쌍문4동', '방학1동', '방학2동', '방학3동', '월계1동', '월계2동', '월계3동', '공릉1동',
       '공릉2동', '하계1동', '하계2동', '중계본동', '중계1동', '중계4동', '중계2.3동', '상계1동',
       '상계2동', '상계3.4동', '상계5동', '상계6.7동', '상계8동', '상계9동', '상계10동', '녹번동',
       '불광1동', '불광2동', '갈현1동', '갈현2동', '구산동', '대조동', '응암1동', '응암2동',
       '응암3동', '역촌동', '신사1동', '신사2동', '증산동', '수색동', '진관동', '천연동', '북아현동',
       '충현동', '신촌동', '연희동', '홍제1동', '홍제3동', '홍제2동', '홍은1동', '홍은2동',
       '남가좌1동', '남가좌2동', '북가좌1동', '북가좌2동', '아현동', '공덕동', '도화동', '용강동',
       '대흥동', '염리동', '신수동', '서강동', '서교동', '합정동', '망원1동', '망원2동', '연남동',
       '성산1동', '성산2동', '상암동', '목1동', '목2동', '목3동', '목4동', '목5동', '신월1동',
       '신월2동', '신월3동', '신월4동', '신월5동', '신월6동', '신월7동', '신정1동', '신정2동',
       '신정3동', '신정4동', '신정6동', '신정7동', '염창동', '등촌1동', '등촌2동', '등촌3동',
       '화곡1동', '화곡2동', '화곡3동', '화곡4동', '화곡본동', '화곡6동', '화곡8동', '가양1동',
       '가양2동', '가양3동', '발산1동', '우장산동', '공항동', '방화1동', '방화2동', '방화3동',
       '신도림동', '구로1동', '구로2동', '구로3동', '구로4동', '구로5동', '가리봉동', '고척1동',
       '고척2동', '개봉1동', '개봉2동', '개봉3동', '오류1동', '오류2동', '수궁동', '가산동',
       '독산1동', '독산2동', '독산3동', '독산4동', '시흥1동', '시흥2동', '시흥3동', '시흥4동',
       '시흥5동', '영등포본동', '영등포동', '여의동', '당산1동', '당산2동', '도림동', '문래동',
       '양평1동', '양평2동', '신길1동', '신길3동', '신길4동', '신길5동', '신길6동', '신길7동',
       '대림1동', '대림2동', '대림3동', '노량진1동', '노량진2동', '상도1동', '상도2동', '상도3동',
       '상도4동', '흑석동', '사당1동', '사당2동', '사당3동', '사당4동', '사당5동', '대방동',
       '신대방1동', '신대방2동', '보라매동', '청림동', '성현동', '행운동', '낙성대동', '청룡동',
       '은천동', '중앙동', '인헌동', '남현동', '서원동', '신원동', '서림동', '신사동', '신림동',
       '난향동', '조원동', '대학동', '삼성동', '미성동', '난곡동', '서초1동', '서초2동', '서초3동',
       '서초4동', '잠원동', '반포본동', '반포1동', '반포2동', '반포3동', '반포4동', '방배본동',
       '방배1동', '방배2동', '방배3동', '방배4동', '양재1동', '양재2동', '내곡동', '논현1동',
       '논현2동', '압구정동', '청담동', '삼성1동', '삼성2동', '대치1동', '대치2동', '대치4동',
       '역삼1동', '역삼2동', '도곡1동', '도곡2동', '개포1동', '개포2동', '개포4동', '세곡동',
       '일원본동', '일원1동', '일원2동', '수서동', '풍납1동', '풍납2동', '거여1동', '거여2동',
       '마천1동', '마천2동', '방이1동', '방이2동', '오륜동', '오금동', '송파1동', '송파2동',
       '석촌동', '삼전동', '가락본동', '가락1동', '가락2동', '문정1동', '문정2동', '장지동',
       '잠실본동', '잠실2동', '잠실3동', '잠실4동', '잠실6동', '잠실7동', '강일동', '상일동',
       '명일1동', '명일2동', '고덕1동', '고덕2동', '암사1동', '암사2동', '암사3동', '천호1동',
       '천호2동', '천호3동', '성내1동', '성내2동', '성내3동', '길동', '둔촌1동', '둔촌2동',
       '신당동', '다산동', '약수동', '청구동', '동화동', '위례동'], dtype=object)

'종로1.2.3.4가동', '종로5.6가동', '금호2.3가동', '중계2.3동', '상계3.4동' >>> 얘넨 뭐여

In [20]:
grouped[grouped.ADMI_NM.str.contains(r'(종로)')]

/Users/kimmh/opt/anaconda3/lib/python3.8/site-packages/pandas/core/strings/accessor.py:101: UserWarning: This pattern has match groups. To actually get the groups, use str.extract.
  return func(self, *args, **kwargs)

       STD_YM   ADMI_CD      ADMI_NM CTY_NM  RSPOP_CNT
8      201112  11110615  종로1.2.3.4가동    종로구       7923
9      201112  11110630      종로5.6가동    종로구       6156
432    201201  11110615  종로1.2.3.4가동    종로구       7957
433    201201  11110630      종로5.6가동    종로구       6192
856    201202  11110615  종로1.2.3.4가동    종로구       7943
...       ...       ...          ...    ...        ...
47462  202105  11110630      종로5.6가동    종로구       5243
47885  202106  11110615  종로1.2.3.4가동    종로구       7226
47886  202106  11110630      종로5.6가동    종로구       5150
48309  202107  11110615  종로1.2.3.4가동    종로구       7204
48310  202107  11110630      종로5.6가동    종로구       5121

[230 rows x 5 columns]

In [38]:
grouped.sort_values(by='RSPOP_CNT', axis=0, ascending=False)

       STD_YM   ADMI_CD ADMI_NM CTY_NM  RSPOP_CNT
45100  202010  11380690     진관동    은평구     114350
45153  202010  11500540    화곡1동    강서구     105096
45095  202010  11380625     역촌동    은평구      93542
45330  202010  11740685      길동    강동구      93282
45145  202010  11470640    신정3동    양천구      93266
...       ...       ...     ...    ...        ...
47027  202102  11740690    둔촌1동    강동구        247
47451  202104  11740690    둔촌1동    강동구        134
48722  202107  11740690    둔촌1동    강동구        134
48299  202106  11740690    둔촌1동    강동구        134
47875  202105  11740690    둔촌1동    강동구        133

[48724 rows x 5 columns]

* 둔촌1동 : 학교 3곳이랑 주공아파트 단지 뿐인데 이 주공아파트가 재건축 들어가서 저렇게 낮게 나옴 
* 진관동 등등 : 네이버 지도 검색해보니 면적이 매우 큼 (특히 1,2,3... 이렇게 안 나뉜 곳들)